app/views/books/books_students.html.erb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      </td>
        <td><%=  Library.find(book.library_id ).name %></td>

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? ORDER BY "libraries"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= book.special_collection %></td>
        <td><%= Library.all.where(:id=>book.library_id).first.name %></td>