app/views/books/getBookmarkBooks.html.erb

			</td>
        <td><%= Library.find(book.library_id).name %></td>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

			 %></td>
      <td><%= Library.find(book.library_id).name %></td>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

			</td>
      <td><%= Library.find(book.library_id).name %></td>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]