app/views/books/search.html.erb

        </td>
        <td><%=  Library.find(result.library_id).name %></td>
---
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]