app/controllers/books_controller.rb

SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def returnBook
    @book = Book.find(params[:id])
    if(@book.count>0)
      if !Checkout.where(:student_id => current_student.id , :book_id => @book.id, :return_date => nil).first.nil?
        @checkout = Checkout.where(:student_id => current_student.id , :book_id => @book.id, :return_date => nil).first
        @checkout.update( :return_date => Date.today)
        @checkout.save!
        flash[:notice] = "Book Successfully returned"
        @user = current_student
        # UserMailer.returnbook_email(@user,@book).deliver_now
        @book.increment(:count)
        @book.save!
      else
        flash[:notice] = "Book is not checked out"
      end
    else
      if !Checkout.where(:student_id => current_student.id , :book_id => @book.id,:return_date => nil).nil?
        @hold_request = HoldRequest.where(:book_id => @book.id).first
        if @hold_request.nil?
          @checkout = Checkout.where(:student_id => current_student.id , :book_id => @book.id , :return_date => nil)
          @checkout.update( :return_date => Date.today)
          flash[:notice] = "Book Successfully returned"
          @user = current_student
          # UserMailer.returnbook_email(@user,@book).deliver_now
          @book.increment(:count)
          @book.save!
        else
          @checkout = Checkout.where(:student_id => current_student.id , :book_id => @book.id )
          @checkout.update( :return_date => Date.today)
          @checkout_new = Checkout.new(:student_id => @hold_request.student_id , :book_id => @hold_request.book_id , :issue_date => Date.today , :return_date =>nil , :validity => Library.find(@book.library_id).borrow_limit)