app/controllers/books_controller.rb

  def books_students
	@books = Book.all.where(:library_id => Library.select('id').where(:university => Student.select('university').where(:email => current_student.email)))
	@books_all = Book.all
---
SELECT "books".* FROM "books"

  def destroy
	if student_signed_in?
      redirect_to students_path, notice: 'Action not allowed.'
	else
		@book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

  def search
	  if params[:search].blank?
		redirect_to('index', alert: "Empty field!") and return
	  elsif params[:search_by]=='title'
			@results = Book.all.where("lower(title) LIKE ?", "%#{params[:search].downcase}%")
---
SELECT "books".* FROM "books" WHERE (lower(authors) LIKE '%lê bảo anh%')

  def checkout # check if the given book is a special book or not
    @book = Book.find(params[:id])
    if @book.special_collection == true
      if Checkout.where(:student_id => current_student.id , :book_id => @book.id, :return_date => nil).first.nil?
        if SpecialBook.where(:student_id => current_student.id , :book_id => @book.id).first.nil?
          @specialbook_request =  SpecialBook.new(:student_id => current_student.id , :book_id => @book.id)
          @specialbook_request.save!
          flash[:notice] = "Book Hold Request Placed"
        else
          flash[:notice] = "Book Hold Request Is Already Placed"
        end
      else
        flash[:notice] = "Book Already Checked Out!!!"
      end
      redirect_to books_students_path
    else
      if(@book.count>0)

        bs = 2
        ms = 4
        phd = 6
        @z = Student.select('education_level').where(:email => current_student.email)
        @t = Checkout.where(:student_id => current_student.id, :return_date => nil).count
        a=0
        if ((@z.first.education_level == 'B.S.' or @z.first.education_level == 'B.S' or @z.first.education_level =='BS') and (@t>=bs)) or ((@z.first.education_level == 'M.S.' or @z.first.education_level == 'M.S' or @z.first.education_level =='MS') and (@t>=ms)) or ((@z.first.education_level == 'Ph.D' or @z.first.education_level == 'PHD' or @z.first.education_level =='Ph.D.') and (@t>=phd))
          flash[:notice] = "You cannot issue more books. Your request has been added to hold request list."
          a = 1
        else
          if Checkout.where(:student_id => current_student.id , :book_id => @book.id, :return_date => nil).first.nil?
            @checkout = Checkout.new(:student_id => current_student.id , :book_id => @book.id , :issue_date => Date.today , :return_date =>nil , :validity => Library.find(@book.library_id).borrow_limit)
            flash[:notice] = "Book Successfully Checked Out"
            puts params[:id]
            puts @book.count
            @book.decrement(:count)
            puts @book.count
            @user = current_student
            UserMailer.checkout_email(@user,@book).deliver_now
            @checkout.save!
            @book.save!
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."student_id" = ? AND "checkouts"."book_id" = ? AND "checkouts"."return_date" IS NULL ORDER BY "checkouts"."id" ASC LIMIT ?  [["student_id", 1], ["book_id", 4], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "special_books".* FROM "special_books" WHERE "special_books"."student_id" = ? AND "special_books"."book_id" = ? ORDER BY "special_books"."id" ASC LIMIT ?  [["student_id", 1], ["book_id", 4], ["LIMIT", 1]]
INSERT INTO "special_books" ("student_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["book_id", 4], ["created_at", "2023-02-13 14:53:40.464048"], ["updated_at", "2023-02-13 14:53:40.464048"]]
SELECT COUNT(*) FROM "checkouts" WHERE "checkouts"."student_id" = ? AND "checkouts"."return_date" IS NULL  [["student_id", 1]]
SELECT "students"."education_level" FROM "students" WHERE "students"."email" = ? ORDER BY "students"."id" ASC LIMIT ?  [["email", "hoanhuy@gmail.com"], ["LIMIT", 1]]
SELECT "students"."education_level" FROM "students" WHERE "students"."email" = ? ORDER BY "students"."id" ASC LIMIT ?  [["email", "huyhoan0901@gmail.com"], ["LIMIT", 1]]
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."student_id" = ? AND "checkouts"."book_id" = ? AND "checkouts"."return_date" IS NULL ORDER BY "checkouts"."id" ASC LIMIT ?  [["student_id", 1], ["book_id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ?, "count" = ? WHERE "books"."id" = ?  [["updated_at", "2023-02-12 14:20:55.504741"], ["count", 9], ["id", 1]]
INSERT INTO "checkouts" ("student_id", "book_id", "issue_date", "validity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["student_id", 1], ["book_id", 1], ["issue_date", "2023-02-13"], ["validity", 20], ["created_at", "2023-02-13 14:53:10.957521"], ["updated_at", "2023-02-13 14:53:10.957521"]]
UPDATE "books" SET "updated_at" = ?, "count" = ? WHERE "books"."id" = ?  [["updated_at", "2023-02-13 14:53:11.160268"], ["count", 9], ["id", 1]]

  def getStudentBookFine
    @checkouts = Checkout.where(:student_id => current_student.id , :return_date => nil )
---
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."student_id" = ? AND "checkouts"."return_date" IS NULL  [["student_id", 3]]

  def getOverdueBooks
    if admin_signed_in?
      @checkouts = Checkout.where(:return_date => nil)
    else
      @checkouts = Checkout.where(:return_date => nil, :book_id => Book.select('id').where(:library_id => Library.select('id').where(:name => current_librarian.library )))
    end
    if !@checkouts.nil?
      @fines = Array.new
      @checkouts.each do |checkout|
---
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."return_date" IS NULL
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."return_date" IS NULL AND "checkouts"."book_id" IN (SELECT "books"."id" FROM "books" WHERE "books"."library_id" IN (SELECT "libraries"."id" FROM "libraries" WHERE "libraries"."name" = ?))  [["name", "Tạ Quang Bửu"]]

  def viewBookHistory
    @checkouts = Checkout.where.not(:return_date => nil ).where(:book_id => params[:id])
---
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."return_date" IS NOT NULL AND "checkouts"."book_id" = ?  [["book_id", 1]]

  def returnBook
    @book = Book.find(params[:id])
    if(@book.count>0)
      if !Checkout.where(:student_id => current_student.id , :book_id => @book.id, :return_date => nil).first.nil?
        @checkout = Checkout.where(:student_id => current_student.id , :book_id => @book.id, :return_date => nil).first
        @checkout.update( :return_date => Date.today)
        @checkout.save!
        flash[:notice] = "Book Successfully returned"
        @user = current_student
        UserMailer.returnbook_email(@user,@book).deliver_now
        @book.increment(:count)
        @book.save!
      else
        flash[:notice] = "Book is not checked out"
      end

    else
      if !Checkout.where(:student_id => current_student.id , :book_id => @book.id,:return_date => nil).nil?
        @hold_request = HoldRequest.where(:book_id => @book.id).first
        if @hold_request.nil?
          @checkout = Checkout.where(:student_id => current_student.id , :book_id => @book.id , :return_date => nil)
          @checkout.update( :return_date => Date.today)
          flash[:notice] = "Book Successfully returned"
          @user = current_student
          UserMailer.returnbook_email(@user,@book).deliver_now
          @book.increment(:count)
          @book.save!
        else
          @checkout = Checkout.where(:student_id => current_student.id , :book_id => @book.id )
          @checkout.update( :return_date => Date.today)
          @checkout_new = Checkout.new(:student_id => @hold_request.student_id , :book_id => @hold_request.book_id , :issue_date => Date.today , :return_date =>nil , :validity => Library.find(@book.library_id).borrow_limit)
          @checkout_new.save!
          flash[:notice] = "Book Successfully returned"
          UserMailer.checkout_email(User.find(@hold_request.student_id),@book).deliver_now
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "checkouts".* FROM "checkouts" WHERE "checkouts"."student_id" = ? AND "checkouts"."book_id" = ? AND "checkouts"."return_date" IS NULL ORDER BY "checkouts"."id" ASC LIMIT ?  [["student_id", 1], ["book_id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ?, "count" = ? WHERE "books"."id" = ?  [["updated_at", "2023-02-12 14:21:08.964497"], ["count", 10], ["id", 1]]
UPDATE "checkouts" SET "return_date" = ?, "updated_at" = ? WHERE "checkouts"."id" = ?  [["return_date", "2023-02-13"], ["updated_at", "2023-02-13 14:53:02.542273"], ["id", 15]]
UPDATE "books" SET "updated_at" = ?, "count" = ? WHERE "books"."id" = ?  [["updated_at", "2023-02-13 14:53:02.740966"], ["count", 10], ["id", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def bookmark
    @book = Book.find(params[:id])
    @bookmark = Bookmark.where(:student_id => current_student.id , :book_id => @book.id).first
    if !@bookmark.nil?
      flash[:notice] = "Book is already bookmarked!!"
    else
      @bookmark = Bookmark.new(:student_id => current_student.id , :book_id => @book.id);
      @user = current_student
      UserMailer.bookmark_email(@user,@book).deliver_now
      @bookmark.save!
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."student_id" = ? AND "bookmarks"."book_id" = ? ORDER BY "bookmarks"."id" ASC LIMIT ?  [["student_id", 1], ["book_id", 1], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("student_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["book_id", 1], ["created_at", "2023-02-13 14:53:48.141455"], ["updated_at", "2023-02-13 14:53:48.141455"]]

  def unbookmark
    @book = Book.find(params[:id])
    @bookmark = Bookmark.where(:student_id => current_student.id , :book_id => @book.id).first
    if !@bookmark.nil?
      @bookmark.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."student_id" = ? AND "bookmarks"."book_id" = ? ORDER BY "bookmarks"."id" ASC LIMIT ?  [["student_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]

  def repealRequest
    @book = Book.find(params[:id])
    if @book.special_collection == true
      @special_book = SpecialBook.where(:book_id => @book.id, :student_id => current_student.id).first
      @special_book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "special_books".* FROM "special_books" WHERE "special_books"."book_id" = ? AND "special_books"."student_id" = ? ORDER BY "special_books"."id" ASC LIMIT ?  [["book_id", 4], ["student_id", 1], ["LIMIT", 1]]
DELETE FROM "special_books" WHERE "special_books"."id" = ?  [["id", 5]]

  def approve_special_book
    @special_book_id = params[:id]
    @special_book  = SpecialBook.find(@special_book_id)
    puts  @special_book.book_id
    @book  = Book.find(@special_book.book_id)
    @checkout = Checkout.new(:student_id => @special_book.student_id , :book_id => @special_book.book_id , :issue_date => Date.today , :return_date =>nil , :validity => Library.find(@book.library_id).borrow_limit)
    flash[:notice] = "Book Successfully Checked Out"
    @book.decrement(:count)
    @user = Student.find(@special_book.student_id)
    UserMailer.checkout_email(@user,@book).deliver_now
    @special_book = SpecialBook.find(@special_book_id)
---
SELECT "books".* FROM "books" WHERE "books"."id" IN (SELECT "special_books"."book_id" FROM "special_books" WHERE "special_books"."student_id" = ?)  [["student_id", 3]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def list_checkedoutBooksAndStudentsAdmin
	#@results = Checkout.joins('INNER JOIN Students s ON s.id = Checkouts.student_id INNER JOIN Books b ON b.id = Checkouts.book_id')
	@results = Checkout.select(:'students.name',:'students.email',:'students.education_level',:'students.university',:'books.isbn',:'books.title',:'books.authors',:issue_date,:return_date,:'books.language',:'books.published',:'books.edition',:'books.subject',:'books.summary',:'books.category',:'books.special_collection').joins(:student).joins(:book)
---
SELECT "students"."name", "students"."email", "students"."education_level", "students"."university", "books"."isbn", "books"."title", "books"."authors", "checkouts"."issue_date", "checkouts"."return_date", "books"."language", "books"."published", "books"."edition", "books"."subject", "books"."summary", "books"."category", "books"."special_collection" FROM "checkouts" INNER JOIN "students" ON "students"."id" = "checkouts"."student_id" INNER JOIN "books" ON "books"."id" = "checkouts"."book_id"