app/controllers/librarians_controller.rb

SELECT "librarians".* FROM "librarians" WHERE "librarians"."email" = ? LIMIT ?  [["email", "hai@gmail.com"], ["LIMIT", 1]]
SELECT "libraries".* FROM "libraries" WHERE "libraries"."name" = ? ORDER BY "libraries"."id" ASC LIMIT ?  [["name", "Tạ Quang Bửu"], ["LIMIT", 1]]
---
  def index
    if admin_signed_in?
      sign_out :librarian
      redirect_to admins_path
	  elsif student_signed_in?
      sign_out :librarian
      redirect_to students_path, notice: 'Action not allowed.'
    else
      if current_librarian.nil?
        current_librarian = @librarian
      else
      @lib = Librarian.find_by!(:email => @librarian[:email])
      current_librarian = @librarian
      if @lib.approved == 'No'
        redirect_to restricted_path
      else
        library_name = current_librarian.library
        puts library_name
        @library = Library.all.where(:name => library_name).first

UPDATE "librarians" SET "approved" = ?, "updated_at" = ?, "encrypted_password" = ? WHERE "librarians"."id" = ?  [["approved", "No"], ["updated_at", "2023-02-09 16:22:45.494378"], ["encrypted_password", "[FILTERED]"], ["id", 12]]
---
  def update
	  if student_signed_in?
      sign_out :librarian
      redirect_to students_path, notice: 'Action not allowed.'
    end
    lib = Airline.find_by!(@librarian[:id])
		respond_to do |format|
		  if lib.update(librarian_params)

DELETE FROM "librarians" WHERE "librarians"."id" = ?  [["id", 10]]
---
  def destroy
	if student_signed_in?
      sign_out :librarian
      redirect_to students_path, notice: 'Action not allowed.'
    else
		@librarian.destroy

SELECT "librarians".* FROM "librarians" WHERE "librarians"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_librarian
      @librarian = Librarian.find(params[:id])